IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM10_CONTROLSS_G2_EPWM10.xml
	<register id="CONTROLSS_G2_EPWM10_ETPS" acronym="CONTROLSS_G2_EPWM10_ETPS" offset="0x14C" width="16" description="Event Trigger Pre-Scale Register">
		<bitfield id="SOCBCNT" width="2" begin="15" end="14" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Counter Register  These bits indicate how many selected ETSEL[SOCBSEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="15 - 14" rwaccess="R"/> 
		<bitfield id="SOCBPRD" width="2" begin="13" end="12" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Period Select  These bits determine how many selected ETSEL[SOCBSEL] events need to occur before an EPWMxSOCB pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCBEN] = 1]. The SOCB pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCB] = 1]. Once the SOCB pulse is generated, the ETPS[SOCBCNT] bits will automatically be cleared.   00: Disable the SOCB event counter. No EPWMxSOCB pulse will be generated  01: Generate the EPWMxSOCB pulse on the first event: ETPS[SOCBCNT] = 0,1  10: Generate the EPWMxSOCB pulse on the second event: ETPS[SOCBCNT] = 1,0  11: Generate the EPWMxSOCB pulse on the third event: ETPS[SOCBCNT] = 1,1" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCACNT" width="2" begin="11" end="10" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Counter Register  These bits indicate how many selected ETSEL[SOCASEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="11 - 10" rwaccess="R"/> 
		<bitfield id="SOCAPRD" width="2" begin="9" end="8" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Period Select  These bits determine how many selected ETSEL[SOCASEL] events need to occur before an EPWMxSOCA pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCAEN] = 1]. The SOCA pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCA] = 1]. Once the SOCA pulse is generated, the ETPS[SOCACNT] bits will automatically be cleared.   00: Disable the SOCA event counter. No EPWMxSOCA pulse will be generated  01: Generate the EPWMxSOCA pulse on the first event: ETPS[SOCACNT] = 0,1  10: Generate the EPWMxSOCA pulse on the second event: ETPS[SOCACNT] = 1,0  11: Generate the EPWMxSOCA pulse on the third event: ETPS[SOCACNT] = 1,1" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCPSSEL" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOC A/B Pre-Scale Selection Bits   0: Selects ETPS [SOCACNT/SOCBCNT] and [SOCAPRD/SOCBPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETSOCPS [SOCACNT2/SOCBCNT2] and [SOCAPRD2/SOCBPRD2] registers to determine frequency of events [interrupt once every 0-15 events]." range="5" rwaccess="R/W"/> 
		<bitfield id="INTPSSEL" width="1" begin="4" end="4" resetval="0x0" description="EPWMxINTn Pre-Scale Selection Bits   0: Selects ETPS [INTCNT, and INTPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETINTPS [ INTCNT2, and INTPRD2 ] registers to determine frequency of events [interrupt once every 0-15 events]." range="4" rwaccess="R/W"/> 
		<bitfield id="INTCNT" width="2" begin="3" end="2" resetval="0x0" description="ePWM Interrupt Event [EPWMx_INT] Counter Register  These bits indicate how many selected ETSEL[INTSEL] events have occurred. These bits are automatically cleared when an interrupt pulse is generated. If interrupts are disabled, ETSEL[INT] = 0 or the interrupt flag is set, ETFLG[INT] = 1, the counter will stop counting events when it reaches the period value ETPS[INTCNT] = ETPS[INTPRD].   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="3 - 2" rwaccess="R"/> 
		<bitfield id="INTPRD" width="2" begin="1" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Period Select  These bits determine how many selected ETSEL[INTSEL] events need to occur before an interrupt is generated. To be generated, the interrupt must be enabled [ETSEL[INT] = 1]. If the interrupt status flag is set from a previous interrupt [ETFLG[INT] = 1] then no interrupt will be generated until the flag is cleared via the ETCLR[INT] bit. This allows for one interrupt to be pending while another is still being serviced. Once the interrupt is generated, the ETPS[INTCNT] bits will automatically be cleared.  Writing a INTPRD value that is the same as the current counter value will trigger an interrupt if it is enabled and the status flag is clear.  Writing a INTPRD value that is less than the current counter value will result in an undefined state. If a counter event occurs at the same instant as a new zero or non-zero INTPRD value is written, the counter is incremented.   00: Disable the interrupt event counter. No interrupt will be generated and ETFRC[INT] is ignored.  01: Generate an interrupt on the first event INTCNT = 01 [first event]  10: Generate interrupt on ETPS[INTCNT] = 1,0 [second event]  11: Generate interrupt on ETPS[INTCNT] = 1,1 [third event]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM10_ETFLG" acronym="CONTROLSS_G2_EPWM10_ETFLG" offset="0x150" width="16" description="Event Trigger Flag Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCB] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCB output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCB. The EPWMxSOCB output will continue to be generated even if the flag bit is set." range="3" rwaccess="R"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCA] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCA output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCA. The EPWMxSOCA output will continue to be generated even if the flag bit is set." range="2" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched ePWM Interrupt [EPWMx_INT] Status Flag   0: Indicates no event occurred  1: Indicates that an ePWMx interrupt [EPWMx_INT] was generated. No further interrupts will be generated until the flag bit is cleared. Up to one interrupt can be pending while the ETFLG[INT] bit is still set. If an interrupt is pending, it will not be generated until after the ETFLG[INT] bit is cleared." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM10_ETCLR" acronym="CONTROLSS_G2_EPWM10_ETCLR" offset="0x154" width="16" description="Event Trigger Clear Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCB] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCB] flag bit" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCA] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCA] flag bit" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[INT] flag bit and enable further interrupts pulses to be generated" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM10_ETFRC" acronym="CONTROLSS_G2_EPWM10_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
